In [1]:
import sqlite3
import pandas as pd

In [2]:
%load_ext sql

In [3]:
conn = sqlite3.connect('Pet.db')

In [4]:
%sql sqlite:///Pet.db

In [5]:
%%sql 

SELECT * from PETSALE

 * sqlite:///Pet.db
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29'),
 (2, 'Dog', 3, 666.66, '2018-06-01'),
 (3, 'Dog', 1, 100, '2018-06-04'),
 (4, 'Parrot', 2, 50, '2018-06-04'),
 (5, 'Dog', 1, 75.75, '2018-06-10'),
 (6, 'Hamster', 6, 60.6, '2018-06-11'),
 (7, 'Cat', 1, 44.44, '2018-06-11'),
 (8, 'Goldfish', 24, 48.48, '2018-06-14'),
 (9, 'Dog', 2, 222.22, '2018-06-15')]

In [6]:
%%sql

SELECT SUM(SALEPRICE) from PETSALE;

 * sqlite:///Pet.db
Done.

[(1718.24,)]

In [7]:
%%sql

SELECT SUM(SALEPRICE) AS SUM_OF_SALEPRICE from PETSALE;

 * sqlite:///Pet.db
Done.

[(1718.24,)]

In [8]:
%%sql

SELECT MAX(QUANTITY) from PETSALE;

 * sqlite:///Pet.db
Done.

[(24,)]

In [9]:
%%sql

SELECT AVG(SALEPRICE) from PETSALE;

 * sqlite:///Pet.db
Done.

[(190.91555555555556,)]

In [10]:
%%sql

SELECT AVG( SALEPRICE / QUANTITY ) from PETSALE WHERE ANIMAL = 'Dog';

 * sqlite:///Pet.db
Done.

[(127.27000000000001,)]

In [11]:
%%sql

SELECT ROUND(SALEPRICE) from PETSALE;

 * sqlite:///Pet.db
Done.

[(450.0,),
 (667.0,),
 (100.0,),
 (50.0,),
 (76.0,),
 (61.0,),
 (44.0,),
 (48.0,),
 (222.0,)]

In [12]:
%%sql

SELECT LENGTH(ANIMAL) from PETSALE;

 * sqlite:///Pet.db
Done.

[(3,), (3,), (3,), (6,), (3,), (7,), (3,), (8,), (3,)]

In [13]:
%%sql

SELECT UPPER(ANIMAL) from PETSALE;

 * sqlite:///Pet.db
Done.

[('CAT',),
 ('DOG',),
 ('DOG',),
 ('PARROT',),
 ('DOG',),
 ('HAMSTER',),
 ('CAT',),
 ('GOLDFISH',),
 ('DOG',)]

In [14]:
%%sql

SELECT DISTINCT(UPPER(ANIMAL)) from PETSALE;

 * sqlite:///Pet.db
Done.

[('CAT',), ('DOG',), ('PARROT',), ('HAMSTER',), ('GOLDFISH',)]

In [15]:
%%sql

SELECT * from PETSALE WHERE LOWER(ANIMAL) = 'cat';

 * sqlite:///Pet.db
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29'), (7, 'Cat', 1, 44.44, '2018-06-11')]

In [16]:
%%sql

SELECT STRFTIME('%d', SALEDATE) as DAY from PETSALE WHERE ANIMAL = 'Cat';

 * sqlite:///Pet.db
Done.

[('29',), ('11',)]

In [17]:
%%sql

SELECT * from PETSALE WHERE STRFTIME('%m', SALEDATE)='05';

 * sqlite:///Pet.db
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29')]

In [18]:
%%sql

SELECT *, DATE(SALEDATE, '+3 day') from PETSALE;

 * sqlite:///Pet.db
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29', '2018-06-01'),
 (2, 'Dog', 3, 666.66, '2018-06-01', '2018-06-04'),
 (3, 'Dog', 1, 100, '2018-06-04', '2018-06-07'),
 (4, 'Parrot', 2, 50, '2018-06-04', '2018-06-07'),
 (5, 'Dog', 1, 75.75, '2018-06-10', '2018-06-13'),
 (6, 'Hamster', 6, 60.6, '2018-06-11', '2018-06-14'),
 (7, 'Cat', 1, 44.44, '2018-06-11', '2018-06-14'),
 (8, 'Goldfish', 24, 48.48, '2018-06-14', '2018-06-17'),
 (9, 'Dog', 2, 222.22, '2018-06-15', '2018-06-18')]

In [19]:
%%sql

SELECT *, (JULIANDAY(DATE())-JULIANDAY(SALEDATE)) as DAY_TILL_NOW from PETSALE;

 * sqlite:///Pet.db
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29', 1866.0),
 (2, 'Dog', 3, 666.66, '2018-06-01', 1863.0),
 (3, 'Dog', 1, 100, '2018-06-04', 1860.0),
 (4, 'Parrot', 2, 50, '2018-06-04', 1860.0),
 (5, 'Dog', 1, 75.75, '2018-06-10', 1854.0),
 (6, 'Hamster', 6, 60.6, '2018-06-11', 1853.0),
 (7, 'Cat', 1, 44.44, '2018-06-11', 1853.0),
 (8, 'Goldfish', 24, 48.48, '2018-06-14', 1850.0),
 (9, 'Dog', 2, 222.22, '2018-06-15', 1849.0)]

In [20]:
conn.close()